artillery/tests/word-search-test copy.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 20
      arrivalRate: 3
      name: Warm up
    - duration: 30
      arrivalRate: 3
      rampTo: 25
      name: Ramp up load
    - duration: 60
      arrivalRate: 50
      name: Sustained load
scenarios:
  - name: "Search words on hobbit.txt file"
    flow:
      - get:
          url: "/files/hobbit.txt/searchWord?word=Bilbo"
      - get:
          url: "/files/hobbit.txt/searchWord?word=of"
      - get:
          url: "/files/hobbit.txt/searchWord?word=I"
      - get:
          url: "/files/hobbit.txt/searchWord?word=and"
      - get:
          url: "/files/hobbit.txt/searchWord?word=as"